jeskick/KK.TRACK/transmitter/pio/tx/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Same as RX / imu_test: schematic UART GPIO21/20 only, no USB-JTAG console
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_TX_GPIO=21
CONFIG_ESP_CONSOLE_UART_RX_GPIO=20
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=n

CONFIG_ESP_PHY_ENABLE_USB=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n

CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y

CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_TASK_STACK_SIZE=5120
CONFIG_BT_NIMBLE_MSYS_1_BLOCK_COUNT=24
CONFIG_BT_NIMBLE_MSYS_2_BLOCK_COUNT=48
CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P6=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=n
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=n
CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_ENCRYPTION=n
CONFIG_BT_NIMBLE_SECURITY_ENABLE=n

CONFIG_ESP_WIFI_ENABLED=n

# BNO085 SPI (board_tx.h / docs/IMU.md)
CONFIG_ESP32_BNO08X_GPIO_HINT=3
CONFIG_ESP32_BNO08X_GPIO_RST=10
CONFIG_ESP32_BNO08X_GPIO_CS=7
CONFIG_ESP32_BNO08X_GPIO_SCL=4
CONFIG_ESP32_BNO08X_GPIO_DI=6
CONFIG_ESP32_BNO08X_GPIO_SDA=5
CONFIG_ESP32_BNO08X_GPIO_WAKE=-1
CONFIG_ESP32_BNO08x_SPI_HOST=1
CONFIG_ESP32_BNO08X_SCL_SPEED_HZ=1000000
CONFIG_ESP32_BNO08X_SPI_INTR_CPU_AFFINITY=0
CONFIG_ESP32_BNO08X_DATA_PROC_TASK_SZ=4096
